driver-tests/bpelse/assign/AssignJbi/test/GlobalAndLocalAttributes/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://sun.com/bpel/GlobalAndLocalAttributesWsdl/types1" xmlns:typ1="http://sun.com/bpel/GlobalAndLocalAttributesWsdl/types3">
  <soapenv:Body>
    <typ:person fname="Tim" typ:lname="Hardin" age="55" typ:sex="M" typ1:ssn="xxx-xx-xxxx"/>
  </soapenv:Body>
</soapenv:Envelope>