driver-tests/bpelse/assign/AssignJbi/test/GlobalAndLocalAttributes/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:employee xmlns:msgns="http://sun.com/bpel/GlobalAndLocalAttributesWsdl" xmlns:ns1="http://sun.com/bpel/GlobalAndLocalAttributesWsdl/types2" xmlns:ns2="http://sun.com/bpel/GlobalAndLocalAttributesWsdl/types2" xmlns:ns4="http://sun.com/bpel/GlobalAndLocalAttributesWsdl/types4" age="55" ns2:firstname="Tim" ns2:lastname="Hardin" ns4:socialSecurityNumber="xxx-xx-xxxx" sex="M"/>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
